import java.util.Random;

public class ElephantRandom extends AdditionalInfo implements Animal{
    private int age;
    private String name;
    private String imageE;
    private String infoE;

    private String []randomName = {"Турок","Пакистанец","Индус","Египтянин","Таец","Мумбаса","Халоп"};
    private String [] additional= {"Затоптал своего наездника","Постоянно дудит, на родине лор заебался лечить местных","Поймали в горах Памира,очень лютый начал устанавливать гегемонию среди горных козлов",
            "Редкий восьминогий экспонат ","Этот похож на Дамбо, прилетел добровольно","У этого экспоната хуй вместо хобота"};


    public int age() {
        Random ageElephant = new Random();
        age = ageElephant.nextInt((30) + 1);

        return age;
    }

    @Override
    public String getImage() {
        imageE=  '\n'+"_________¶¶¶¶¶¶¶¶¶"+'\n'+
                "________¶¶¶_____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶"+'\n'+
                "______¶¶¶____¶¶¶¶¶¶¶¶___________¶¶¶"+'\n'+
                "____¶¶¶______¶______¶¶____________¶¶"+'\n'+
                "___¶¶_______________¶¶_____________¶¶"+'\n'+
                "___¶¶__¶¶___¶_______¶_______________¶"+'\n'+
                "__¶¶___¶¶___¶¶¶____¶¶_______________¶¶"+'\n'+
                "__¶¶_________¶¶¶¶__¶_________________¶"+'\n'+
                "__¶___¶¶¶¶¶¶___¶¶¶_¶__________¶______¶¶"+'\n'+
                "_¶__¶¶¶¶¶¶¶______¶¶¶_________¶¶______¶¶¶"+'\n'+
                "_¶_¶¶¶¶¶__¶¶_¶______________¶¶______¶¶¶¶"+'\n'+
                "¶¶_¶¶¶_____¶¶¶¶_____¶¶_____¶¶¶______¶_¶¶¶"+'\n'+
                "¶__¶¶¶¶_____¶¶¶_____¶¶____¶¶¶______¶___¶¶"+'\n'+
                "¶__¶¶_¶¶____¶¶¶_____¶¶__¶¶¶¶_____¶¶____¶¶¶"+'\n'+
                "¶__¶¶_¶¶_____¶_____¶¶¶¶¶¶¶¶_____¶¶______¶¶¶"+'\n'+
                "¶¶____¶¶____¶¶____¶¶__¶¶¶¶¶_____¶________¶¶¶¶"+'\n'+
                "_¶¶¶¶¶¶_____¶¶____¶¶____¶_¶¶___¶¶_________¶¶¶"+'\n'+
                "___¶¶_______¶¶____¶¶____¶¶¶¶___¶"+'\n'+
                "____________¶¶____¶¶____¶¶¶____¶"+'\n'+
                "____________¶¶_____¶___¶¶¶¶____¶"+'\n'+
                "____________¶¶_____¶___¶¶¶¶¶¶¶_¶"+'\n'+
                "____________¶¶¶¶¶¶¶¶_____¶¶¶¶¶¶¶"+'\n'+
                "____________¶¶¶¶¶¶¶";
            return imageE;    }


    @Override
    public String getInfo() {
         infoE=additional[(int) (Math.random()*6)];
        return infoE+'\n';
    }


    public String name() {
        name = randomName [(int) (Math.random()*7)];
        return name;}

    @Override
    public String goToToilet() {
        return null;
    }

    @Override
    public String say() {return  "Туу-тууууу";

    }

    public String getAnimalClass(){
        return "Слон:  ";}

    public String toString() {
        return getAnimalClass() +
                "age=" + age() +
                " name='" + name() + ";"+'\n';

}}

